TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Stats.h
/*******************************************************************************
 * Field Definition Macros
 ******************************************************************************/
/* RXGOODFRAMES */

#define CPSW_STAT_0_RXGOODFRAMES_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_0_RXGOODFRAMES_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_0_RXGOODFRAMES_COUNT_MAX               (0xFFFFFFFFU)

/* RXBROADCASTFRAMES */

#define CPSW_STAT_0_RXBROADCASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_RXBROADCASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_RXBROADCASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXMULTICASTFRAMES */

#define CPSW_STAT_0_RXMULTICASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_RXMULTICASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_RXMULTICASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXCRCERRORS */

#define CPSW_STAT_0_RXCRCERRORS_COUNT_MASK               (0xFFFFFFFFU)
#define CPSW_STAT_0_RXCRCERRORS_COUNT_SHIFT              (0x00000000U)
#define CPSW_STAT_0_RXCRCERRORS_COUNT_MAX                (0xFFFFFFFFU)

/* RXOVERSIZEDFRAMES */

#define CPSW_STAT_0_RXOVERSIZEDFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_RXOVERSIZEDFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_RXOVERSIZEDFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXUNDERSIZEDFRAMES */

#define CPSW_STAT_0_RXUNDERSIZEDFRAMES_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_0_RXUNDERSIZEDFRAMES_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_0_RXUNDERSIZEDFRAMES_COUNT_MAX         (0xFFFFFFFFU)

/* RXFRAGMENTS */

#define CPSW_STAT_0_RXFRAGMENTS_COUNT_MASK               (0xFFFFFFFFU)
#define CPSW_STAT_0_RXFRAGMENTS_COUNT_SHIFT              (0x00000000U)
#define CPSW_STAT_0_RXFRAGMENTS_COUNT_MAX                (0xFFFFFFFFU)

/* ALE_DROP */

#define CPSW_STAT_0_ALE_DROP_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_DROP_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_0_ALE_DROP_COUNT_MAX                   (0xFFFFFFFFU)

/* ALE_OVERRUN_DROP */

#define CPSW_STAT_0_ALE_OVERRUN_DROP_COUNT_MASK          (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_OVERRUN_DROP_COUNT_SHIFT         (0x00000000U)
#define CPSW_STAT_0_ALE_OVERRUN_DROP_COUNT_MAX           (0xFFFFFFFFU)

/* RXOCTETS */

#define CPSW_STAT_0_RXOCTETS_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_0_RXOCTETS_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_0_RXOCTETS_COUNT_MAX                   (0xFFFFFFFFU)

/* TXGOODFRAMES */

#define CPSW_STAT_0_TXGOODFRAMES_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_0_TXGOODFRAMES_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_0_TXGOODFRAMES_COUNT_MAX               (0xFFFFFFFFU)

/* TXBROADCASTFRAMES */

#define CPSW_STAT_0_TXBROADCASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_TXBROADCASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_TXBROADCASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* TXMULTICASTFRAMES */

#define CPSW_STAT_0_TXMULTICASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_TXMULTICASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_TXMULTICASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* TXOCTETS */

#define CPSW_STAT_0_TXOCTETS_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_0_TXOCTETS_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_0_TXOCTETS_COUNT_MAX                   (0xFFFFFFFFU)

/* OCTETFRAMES64 */

#define CPSW_STAT_0_OCTETFRAMES64_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES64_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES64_COUNT_MAX              (0xFFFFFFFFU)

/* OCTETFRAMES65T127 */

#define CPSW_STAT_0_OCTETFRAMES65T127_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES65T127_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES65T127_COUNT_MAX          (0xFFFFFFFFU)

/* OCTETFRAMES128T255 */

#define CPSW_STAT_0_OCTETFRAMES128T255_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES128T255_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES128T255_COUNT_MAX         (0xFFFFFFFFU)

/* OCTETFRAMES256T511 */

#define CPSW_STAT_0_OCTETFRAMES256T511_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES256T511_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES256T511_COUNT_MAX         (0xFFFFFFFFU)

/* OCTETFRAMES512T1023 */

#define CPSW_STAT_0_OCTETFRAMES512T1023_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES512T1023_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES512T1023_COUNT_MAX        (0xFFFFFFFFU)

/* OCTETFRAMES1024TUP */

#define CPSW_STAT_0_OCTETFRAMES1024TUP_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_0_OCTETFRAMES1024TUP_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_0_OCTETFRAMES1024TUP_COUNT_MAX         (0xFFFFFFFFU)

/* NETOCTETS */

#define CPSW_STAT_0_NETOCTETS_COUNT_MASK                 (0xFFFFFFFFU)
#define CPSW_STAT_0_NETOCTETS_COUNT_SHIFT                (0x00000000U)
#define CPSW_STAT_0_NETOCTETS_COUNT_MAX                  (0xFFFFFFFFU)

/* RX_BOTTOM_OF_FIFO_DROP */

#define CPSW_STAT_0_RX_BOTTOM_OF_FIFO_DROP_COUNT_MASK    (0xFFFFFFFFU)
#define CPSW_STAT_0_RX_BOTTOM_OF_FIFO_DROP_COUNT_SHIFT   (0x00000000U)
#define CPSW_STAT_0_RX_BOTTOM_OF_FIFO_DROP_COUNT_MAX     (0xFFFFFFFFU)

/* PORTMASK_DROP */

#define CPSW_STAT_0_PORTMASK_DROP_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_0_PORTMASK_DROP_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_0_PORTMASK_DROP_COUNT_MAX              (0xFFFFFFFFU)

/* RX_TOP_OF_FIFO_DROP */

#define CPSW_STAT_0_RX_TOP_OF_FIFO_DROP_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_0_RX_TOP_OF_FIFO_DROP_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_0_RX_TOP_OF_FIFO_DROP_COUNT_MAX        (0xFFFFFFFFU)

/* ALE_RATE_LIMIT_DROP */

#define CPSW_STAT_0_ALE_RATE_LIMIT_DROP_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_RATE_LIMIT_DROP_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_0_ALE_RATE_LIMIT_DROP_COUNT_MAX        (0xFFFFFFFFU)

