TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Stats.h
/* ALE_VID_INGRESS_DROP */

#define CPSW_STAT_0_ALE_VID_INGRESS_DROP_COUNT_MASK      (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_VID_INGRESS_DROP_COUNT_SHIFT     (0x00000000U)
#define CPSW_STAT_0_ALE_VID_INGRESS_DROP_COUNT_MAX       (0xFFFFFFFFU)

/* ALE_DA_EQ_SA_DROP */

#define CPSW_STAT_0_ALE_DA_EQ_SA_DROP_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_DA_EQ_SA_DROP_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_ALE_DA_EQ_SA_DROP_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_BLOCK_DROP */

#define CPSW_STAT_0_ALE_BLOCK_DROP_COUNT_MASK            (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_BLOCK_DROP_COUNT_SHIFT           (0x00000000U)
#define CPSW_STAT_0_ALE_BLOCK_DROP_COUNT_MAX             (0xFFFFFFFFU)

/* ALE_SECURE_DROP */

#define CPSW_STAT_0_ALE_SECURE_DROP_COUNT_MASK           (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_SECURE_DROP_COUNT_SHIFT          (0x00000000U)
#define CPSW_STAT_0_ALE_SECURE_DROP_COUNT_MAX            (0xFFFFFFFFU)

/* ALE_AUTH_DROP */

#define CPSW_STAT_0_ALE_AUTH_DROP_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_AUTH_DROP_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_0_ALE_AUTH_DROP_COUNT_MAX              (0xFFFFFFFFU)

/* ALE_UNKN_UNI */

#define CPSW_STAT_0_ALE_UNKN_UNI_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_UNI_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_UNI_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_UNI_BCNT */

#define CPSW_STAT_0_ALE_UNKN_UNI_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_UNI_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_UNI_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_UNKN_MLT */

#define CPSW_STAT_0_ALE_UNKN_MLT_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_MLT_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_MLT_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_MLT_BCNT */

#define CPSW_STAT_0_ALE_UNKN_MLT_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_MLT_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_MLT_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_UNKN_BRD */

#define CPSW_STAT_0_ALE_UNKN_BRD_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_BRD_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_BRD_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_BRD_BCNT */

#define CPSW_STAT_0_ALE_UNKN_BRD_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_UNKN_BRD_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_ALE_UNKN_BRD_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_POL_MATCH */

#define CPSW_STAT_0_ALE_POL_MATCH_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_POL_MATCH_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_0_ALE_POL_MATCH_COUNT_MAX              (0xFFFFFFFFU)

/* ALE_POL_MATCH_RED */

#define CPSW_STAT_0_ALE_POL_MATCH_RED_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_POL_MATCH_RED_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_0_ALE_POL_MATCH_RED_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_POL_MATCH_YELLOW */

#define CPSW_STAT_0_ALE_POL_MATCH_YELLOW_COUNT_MASK      (0xFFFFFFFFU)
#define CPSW_STAT_0_ALE_POL_MATCH_YELLOW_COUNT_SHIFT     (0x00000000U)
#define CPSW_STAT_0_ALE_POL_MATCH_YELLOW_COUNT_MAX       (0xFFFFFFFFU)

/* TX_MEMORY_PROTECT_ERROR */

#define CPSW_STAT_0_TX_MEMORY_PROTECT_ERROR_COUNT_MASK   (0x000000FFU)
#define CPSW_STAT_0_TX_MEMORY_PROTECT_ERROR_COUNT_SHIFT  (0x00000000U)
#define CPSW_STAT_0_TX_MEMORY_PROTECT_ERROR_COUNT_MAX    (0x000000FFU)

/* RXGOODFRAMES */

#define CPSW_STAT_1_RXGOODFRAMES_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_1_RXGOODFRAMES_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_1_RXGOODFRAMES_COUNT_MAX               (0xFFFFFFFFU)

/* RXBROADCASTFRAMES */

#define CPSW_STAT_1_RXBROADCASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_RXBROADCASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_RXBROADCASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXMULTICASTFRAMES */

#define CPSW_STAT_1_RXMULTICASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_RXMULTICASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_RXMULTICASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXPAUSEFRAMES */

#define CPSW_STAT_1_RXPAUSEFRAMES_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_RXPAUSEFRAMES_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_RXPAUSEFRAMES_COUNT_MAX              (0xFFFFFFFFU)

/* RXCRCERRORS */

#define CPSW_STAT_1_RXCRCERRORS_COUNT_MASK               (0xFFFFFFFFU)
#define CPSW_STAT_1_RXCRCERRORS_COUNT_SHIFT              (0x00000000U)
#define CPSW_STAT_1_RXCRCERRORS_COUNT_MAX                (0xFFFFFFFFU)

/* RXALIGNCODEERRORS */

#define CPSW_STAT_1_RXALIGNCODEERRORS_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_RXALIGNCODEERRORS_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_RXALIGNCODEERRORS_COUNT_MAX          (0xFFFFFFFFU)

/* RXOVERSIZEDFRAMES */

#define CPSW_STAT_1_RXOVERSIZEDFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_RXOVERSIZEDFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_RXOVERSIZEDFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* RXJABBERFRAMES */

#define CPSW_STAT_1_RXJABBERFRAMES_COUNT_MASK            (0xFFFFFFFFU)
#define CPSW_STAT_1_RXJABBERFRAMES_COUNT_SHIFT           (0x00000000U)
#define CPSW_STAT_1_RXJABBERFRAMES_COUNT_MAX             (0xFFFFFFFFU)

/* RXUNDERSIZEDFRAMES */

#define CPSW_STAT_1_RXUNDERSIZEDFRAMES_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_1_RXUNDERSIZEDFRAMES_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_1_RXUNDERSIZEDFRAMES_COUNT_MAX         (0xFFFFFFFFU)

/* RXFRAGMENTS */

#define CPSW_STAT_1_RXFRAGMENTS_COUNT_MASK               (0xFFFFFFFFU)
#define CPSW_STAT_1_RXFRAGMENTS_COUNT_SHIFT              (0x00000000U)
#define CPSW_STAT_1_RXFRAGMENTS_COUNT_MAX                (0xFFFFFFFFU)

/* ALE_DROP */

#define CPSW_STAT_1_ALE_DROP_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_DROP_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_1_ALE_DROP_COUNT_MAX                   (0xFFFFFFFFU)

