TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Stats.h
/* ALE_OVERRUN_DROP */

#define CPSW_STAT_1_ALE_OVERRUN_DROP_COUNT_MASK          (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_OVERRUN_DROP_COUNT_SHIFT         (0x00000000U)
#define CPSW_STAT_1_ALE_OVERRUN_DROP_COUNT_MAX           (0xFFFFFFFFU)

/* RXOCTETS */

#define CPSW_STAT_1_RXOCTETS_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_1_RXOCTETS_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_1_RXOCTETS_COUNT_MAX                   (0xFFFFFFFFU)

/* TXGOODFRAMES */

#define CPSW_STAT_1_TXGOODFRAMES_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_1_TXGOODFRAMES_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_1_TXGOODFRAMES_COUNT_MAX               (0xFFFFFFFFU)

/* TXBROADCASTFRAMES */

#define CPSW_STAT_1_TXBROADCASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_TXBROADCASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_TXBROADCASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* TXMULTICASTFRAMES */

#define CPSW_STAT_1_TXMULTICASTFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_TXMULTICASTFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_TXMULTICASTFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* TXPAUSEFRAMES */

#define CPSW_STAT_1_TXPAUSEFRAMES_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_TXPAUSEFRAMES_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_TXPAUSEFRAMES_COUNT_MAX              (0xFFFFFFFFU)

/* TXDEFERREDFRAMES */

#define CPSW_STAT_1_TXDEFERREDFRAMES_COUNT_MASK          (0xFFFFFFFFU)
#define CPSW_STAT_1_TXDEFERREDFRAMES_COUNT_SHIFT         (0x00000000U)
#define CPSW_STAT_1_TXDEFERREDFRAMES_COUNT_MAX           (0xFFFFFFFFU)

/* TXCOLLISIONFRAMES */

#define CPSW_STAT_1_TXCOLLISIONFRAMES_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_TXCOLLISIONFRAMES_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_TXCOLLISIONFRAMES_COUNT_MAX          (0xFFFFFFFFU)

/* TXSINGLECOLLFRAMES */

#define CPSW_STAT_1_TXSINGLECOLLFRAMES_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_1_TXSINGLECOLLFRAMES_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_1_TXSINGLECOLLFRAMES_COUNT_MAX         (0xFFFFFFFFU)

/* TXMULTCOLLFRAMES */

#define CPSW_STAT_1_TXMULTCOLLFRAMES_COUNT_MASK          (0xFFFFFFFFU)
#define CPSW_STAT_1_TXMULTCOLLFRAMES_COUNT_SHIFT         (0x00000000U)
#define CPSW_STAT_1_TXMULTCOLLFRAMES_COUNT_MAX           (0xFFFFFFFFU)

/* TXEXCESSIVECOLLISIONS */

#define CPSW_STAT_1_TXEXCESSIVECOLLISIONS_COUNT_MASK     (0xFFFFFFFFU)
#define CPSW_STAT_1_TXEXCESSIVECOLLISIONS_COUNT_SHIFT    (0x00000000U)
#define CPSW_STAT_1_TXEXCESSIVECOLLISIONS_COUNT_MAX      (0xFFFFFFFFU)

/* TXLATECOLLISIONS */

#define CPSW_STAT_1_TXLATECOLLISIONS_COUNT_MASK          (0xFFFFFFFFU)
#define CPSW_STAT_1_TXLATECOLLISIONS_COUNT_SHIFT         (0x00000000U)
#define CPSW_STAT_1_TXLATECOLLISIONS_COUNT_MAX           (0xFFFFFFFFU)

/* RXIPGERROR */

#define CPSW_STAT_1_RXIPGERROR_COUNT_MASK                (0xFFFFFFFFU)
#define CPSW_STAT_1_RXIPGERROR_COUNT_SHIFT               (0x00000000U)
#define CPSW_STAT_1_RXIPGERROR_COUNT_MAX                 (0xFFFFFFFFU)

/* TXCARRIERSENSEERRORS */

#define CPSW_STAT_1_TXCARRIERSENSEERRORS_COUNT_MASK      (0xFFFFFFFFU)
#define CPSW_STAT_1_TXCARRIERSENSEERRORS_COUNT_SHIFT     (0x00000000U)
#define CPSW_STAT_1_TXCARRIERSENSEERRORS_COUNT_MAX       (0xFFFFFFFFU)

/* TXOCTETS */

#define CPSW_STAT_1_TXOCTETS_COUNT_MASK                  (0xFFFFFFFFU)
#define CPSW_STAT_1_TXOCTETS_COUNT_SHIFT                 (0x00000000U)
#define CPSW_STAT_1_TXOCTETS_COUNT_MAX                   (0xFFFFFFFFU)

/* OCTETFRAMES64 */

#define CPSW_STAT_1_OCTETFRAMES64_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES64_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES64_COUNT_MAX              (0xFFFFFFFFU)

/* OCTETFRAMES65T127 */

#define CPSW_STAT_1_OCTETFRAMES65T127_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES65T127_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES65T127_COUNT_MAX          (0xFFFFFFFFU)

/* OCTETFRAMES128T255 */

#define CPSW_STAT_1_OCTETFRAMES128T255_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES128T255_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES128T255_COUNT_MAX         (0xFFFFFFFFU)

/* OCTETFRAMES256T511 */

#define CPSW_STAT_1_OCTETFRAMES256T511_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES256T511_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES256T511_COUNT_MAX         (0xFFFFFFFFU)

/* OCTETFRAMES512T1023 */

#define CPSW_STAT_1_OCTETFRAMES512T1023_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES512T1023_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES512T1023_COUNT_MAX        (0xFFFFFFFFU)

/* OCTETFRAMES1024TUP */

#define CPSW_STAT_1_OCTETFRAMES1024TUP_COUNT_MASK        (0xFFFFFFFFU)
#define CPSW_STAT_1_OCTETFRAMES1024TUP_COUNT_SHIFT       (0x00000000U)
#define CPSW_STAT_1_OCTETFRAMES1024TUP_COUNT_MAX         (0xFFFFFFFFU)

/* NETOCTETS */

#define CPSW_STAT_1_NETOCTETS_COUNT_MASK                 (0xFFFFFFFFU)
#define CPSW_STAT_1_NETOCTETS_COUNT_SHIFT                (0x00000000U)
#define CPSW_STAT_1_NETOCTETS_COUNT_MAX                  (0xFFFFFFFFU)

/* RX_BOTTOM_OF_FIFO_DROP */

#define CPSW_STAT_1_RX_BOTTOM_OF_FIFO_DROP_COUNT_MASK    (0xFFFFFFFFU)
#define CPSW_STAT_1_RX_BOTTOM_OF_FIFO_DROP_COUNT_SHIFT   (0x00000000U)
#define CPSW_STAT_1_RX_BOTTOM_OF_FIFO_DROP_COUNT_MAX     (0xFFFFFFFFU)

/* PORTMASK_DROP */

#define CPSW_STAT_1_PORTMASK_DROP_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_PORTMASK_DROP_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_PORTMASK_DROP_COUNT_MAX              (0xFFFFFFFFU)

/* RX_TOP_OF_FIFO_DROP */

#define CPSW_STAT_1_RX_TOP_OF_FIFO_DROP_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_1_RX_TOP_OF_FIFO_DROP_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_1_RX_TOP_OF_FIFO_DROP_COUNT_MAX        (0xFFFFFFFFU)

/* ALE_RATE_LIMIT_DROP */

#define CPSW_STAT_1_ALE_RATE_LIMIT_DROP_COUNT_MASK       (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_RATE_LIMIT_DROP_COUNT_SHIFT      (0x00000000U)
#define CPSW_STAT_1_ALE_RATE_LIMIT_DROP_COUNT_MAX        (0xFFFFFFFFU)

