TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Stats.h
/* ALE_VID_INGRESS_DROP */

#define CPSW_STAT_1_ALE_VID_INGRESS_DROP_COUNT_MASK      (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_VID_INGRESS_DROP_COUNT_SHIFT     (0x00000000U)
#define CPSW_STAT_1_ALE_VID_INGRESS_DROP_COUNT_MAX       (0xFFFFFFFFU)

/* ALE_DA_EQ_SA_DROP */

#define CPSW_STAT_1_ALE_DA_EQ_SA_DROP_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_DA_EQ_SA_DROP_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_ALE_DA_EQ_SA_DROP_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_BLOCK_DROP */

#define CPSW_STAT_1_ALE_BLOCK_DROP_COUNT_MASK            (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_BLOCK_DROP_COUNT_SHIFT           (0x00000000U)
#define CPSW_STAT_1_ALE_BLOCK_DROP_COUNT_MAX             (0xFFFFFFFFU)

/* ALE_SECURE_DROP */

#define CPSW_STAT_1_ALE_SECURE_DROP_COUNT_MASK           (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_SECURE_DROP_COUNT_SHIFT          (0x00000000U)
#define CPSW_STAT_1_ALE_SECURE_DROP_COUNT_MAX            (0xFFFFFFFFU)

/* ALE_AUTH_DROP */

#define CPSW_STAT_1_ALE_AUTH_DROP_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_AUTH_DROP_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_ALE_AUTH_DROP_COUNT_MAX              (0xFFFFFFFFU)

/* ALE_UNKN_UNI */

#define CPSW_STAT_1_ALE_UNKN_UNI_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_UNI_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_UNI_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_UNI_BCNT */

#define CPSW_STAT_1_ALE_UNKN_UNI_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_UNI_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_UNI_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_UNKN_MLT */

#define CPSW_STAT_1_ALE_UNKN_MLT_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_MLT_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_MLT_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_MLT_BCNT */

#define CPSW_STAT_1_ALE_UNKN_MLT_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_MLT_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_MLT_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_UNKN_BRD */

#define CPSW_STAT_1_ALE_UNKN_BRD_COUNT_MASK              (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_BRD_COUNT_SHIFT             (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_BRD_COUNT_MAX               (0xFFFFFFFFU)

/* ALE_UNKN_BRD_BCNT */

#define CPSW_STAT_1_ALE_UNKN_BRD_BCNT_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_UNKN_BRD_BCNT_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_ALE_UNKN_BRD_BCNT_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_POL_MATCH */

#define CPSW_STAT_1_ALE_POL_MATCH_COUNT_MASK             (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_POL_MATCH_COUNT_SHIFT            (0x00000000U)
#define CPSW_STAT_1_ALE_POL_MATCH_COUNT_MAX              (0xFFFFFFFFU)

/* ALE_POL_MATCH_RED */

#define CPSW_STAT_1_ALE_POL_MATCH_RED_COUNT_MASK         (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_POL_MATCH_RED_COUNT_SHIFT        (0x00000000U)
#define CPSW_STAT_1_ALE_POL_MATCH_RED_COUNT_MAX          (0xFFFFFFFFU)

/* ALE_POL_MATCH_YELLOW */

#define CPSW_STAT_1_ALE_POL_MATCH_YELLOW_COUNT_MASK      (0xFFFFFFFFU)
#define CPSW_STAT_1_ALE_POL_MATCH_YELLOW_COUNT_SHIFT     (0x00000000U)
#define CPSW_STAT_1_ALE_POL_MATCH_YELLOW_COUNT_MAX       (0xFFFFFFFFU)

/* TX_MEMORY_PROTECT_ERROR */

#define CPSW_STAT_1_TX_MEMORY_PROTECT_ERROR_COUNT_MASK   (0x000000FFU)
#define CPSW_STAT_1_TX_MEMORY_PROTECT_ERROR_COUNT_SHIFT  (0x00000000U)
#define CPSW_STAT_1_TX_MEMORY_PROTECT_ERROR_COUNT_MAX    (0x000000FFU)

/* ENET_PN_TX_PRI_REG */

#define CPSW_STAT_1_ENET_PN_TX_PRI_REG_PN_TX_PRIN_MASK   (0xFFFFFFFFU)
#define CPSW_STAT_1_ENET_PN_TX_PRI_REG_PN_TX_PRIN_SHIFT  (0x00000000U)
#define CPSW_STAT_1_ENET_PN_TX_PRI_REG_PN_TX_PRIN_MAX    (0xFFFFFFFFU)

/* ENET_PN_TX_PRI_BCNT_REG */

#define CPSW_STAT_1_ENET_PN_TX_PRI_BCNT_REG_PN_TX_PRIN_BCNT_MASK (0xFFFFFFFFU)
#define CPSW_STAT_1_ENET_PN_TX_PRI_BCNT_REG_PN_TX_PRIN_BCNT_SHIFT (0x00000000U)
#define CPSW_STAT_1_ENET_PN_TX_PRI_BCNT_REG_PN_TX_PRIN_BCNT_MAX (0xFFFFFFFFU)

/* ENET_PN_TX_PRI_DROP_REG */

#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_REG_PN_TX_PRIN_DROP_MASK (0xFFFFFFFFU)
#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_REG_PN_TX_PRIN_DROP_SHIFT (0x00000000U)
#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_REG_PN_TX_PRIN_DROP_MAX (0xFFFFFFFFU)

/* ENET_PN_TX_PRI_DROP_BCNT_REG */

#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_BCNT_REG_PN_TX_PRIN_DROP_BCNT_MASK (0xFFFFFFFFU)
#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_BCNT_REG_PN_TX_PRIN_DROP_BCNT_SHIFT (0x00000000U)
#define CPSW_STAT_1_ENET_PN_TX_PRI_DROP_BCNT_REG_PN_TX_PRIN_DROP_BCNT_MAX (0xFFFFFFFFU)


#ifdef __cplusplus
}
#endif
#endif  /* HW_CPSW_STATS_H_ */
